{"name":"Dialogs","version":"2.9.2","keywords":[{"name":"Execute Manual Step","args":["message","default_error="],"doc":"Pauses test execution until user sets the keyword status.\n\nUser can press either `PASS` or `FAIL` button. In the latter case execution fails and an additional dialog is opened for defining the error message.\n\n`message` is the instruction shown in the initial dialog and `default_error` is the default value shown in the possible error message dialog."},{"name":"Get Selection From User","args":["message","*values"],"doc":"Pauses test execution and asks user to select a value.\n\nThe selected value is returned. Pressing `Cancel` fails the keyword.\n\n`message` is the instruction shown in the dialog and `values` are the options given to the user.\n\nExample:\n\n```\n${username} =  Get Selection From User  Select user name  user1  user2  admin\n```"},{"name":"Get Value From User","args":["message","default_value=","hidden=False"],"doc":"Pauses test execution and asks user to input a value.\n\nValue typed by the user, or the possible default value, is returned. Returning an empty value is fine, but pressing `Cancel` fails the keyword.\n\n`message` is the instruction shown in the dialog and `default_value` is the possible default value shown in the input field.\n\nIf `hidden` is given a true value, the value typed by the user is hidden. `hidden` is considered true if it is a non-empty string not equal to `false` or `no`, case-insensitively. If it is not a string, its truth value is got directly using same [rules as in Python](http://docs.python.org/2/library/stdtypes.html#truth-value-testing).\n\nExample:\n\n```\n${username} =  Get Value From User  Input user name  default\n${password} =  Get Value From User  Input password  hidden=yes\n```\n\nPossibility to hide the typed in value is new in Robot Framework 2.8.4. Considering strings `false` and `no` to be false is new in 2.9."},{"name":"Pause Execution","args":["message=Test execution paused. Press OK to continue."],"doc":"Pauses test execution until user clicks `Ok` button.\n\n`message` is the message shown in the dialog."}]}